In [1]:
import pandas as pd
df_movies = pd.read_csv('IMDb movies.csv',low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [2]:
# select columns
df_movies = df_movies[['imdb_title_id', 'title', 'year',
                       'genre', 'country', 'director', 'actors']]

df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# merge()

In [3]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                    'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})

# Left join

In [4]:
df1.merge(df2, on='id', how='left')

  id  age           job
0  A   30           NaN
1  B   23           NaN
2  C   25        Doctor
3  D   22  Statistician

# Exercise

In [7]:
# extract a 50% sample of the df_movies dataframe
df_sample = df_movies.sample(frac=0.5)

In [10]:
# merge df_sample and df_ratings (left join)
df_sm = df_sample.merge(df_ratings, on = 'imdb_title_id', how='left')

In [11]:
# shape
df_sm.shape

(42928, 9)

# Exclusive Left join

In [14]:
# indicator=True
df1.merge(df2, on='id', how='outer',
          indicator = True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [16]:
#query
df1.merge(df2, on='id', how='outer',
          indicator=True).query("_merge=='left_only'")

  id   age  job     _merge
0  A  30.0  NaN  left_only
1  B  23.0  NaN  left_only

In [17]:
# left join
pd.merge(df_movies, df_ratings.sample(frac=.5),
         on='imdb_title_id', how='left').shape

(85855, 9)

# Exercise

In [35]:
# make a copy of the df_movies dataframe
df_movies_copy = df_movies.copy()

In [36]:
# set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
df_movies.loc[:999, 'imdb_title_id'] = 'tt1234567890'

In [38]:
# merge df_movies_copy and df_ratings (exclusive left join)
df_left_only = df_movies_copy.merge(df_ratings, on='imdb_title_id', how='left',
                     indicator=True).query("_merge=='left_only'")

In [39]:
# shape
df_left_only.shape

(1000, 10)

In [40]:
df_left_only

,imdb_title_id,title,year,genre,country,director,actors,total_votes,mean_vote,_merge
0,tt1234567890,Miss Jerry,1894,Romance,USA,Alexander Black,"Blanche Bayliss, William Courtenay, Chauncey D...",NaN,NaN,left_only
1,tt1234567890,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,Charles Tait,"Elizabeth Tait, John Tait, Norman Campbell, Be...",NaN,NaN,left_only
2,tt1234567890,Den sorte drøm,1911,Drama,"Germany, Denmark",Urban Gad,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",NaN,NaN,left_only
3,tt1234567890,Cleopatra,1912,"Drama, History",USA,Charles L. Gaskill,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",NaN,NaN,left_only
4,tt1234567890,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,"Francesco Bertolini, Adolfo Padovan","Salvatore Papa, Arturo Pirovano, Giuseppe de L...",NaN,NaN,left_only
...,...,...,...,...,...,...,...,...,...,...
995,tt1234567890,Agente segreto Z1,1930,Drama,USA,Roy Del Ruth,"Constance Bennett, Erich von Stroheim, Anthony...",NaN,NaN,left_only
996,tt1234567890,Tom Sawyer,1930,"Adventure, Comedy, Drama",USA,John Cromwell,"Jackie Coogan, Junior Durkin, Mitzi Green, Luc...",NaN,NaN,left_only
997,tt1234567890,Tonka Sibenice,1930,Drama,"Czechoslovakia, Germany",Karl Anton,"Ita Rina, Vera Baranovskaya, Josef Rovenský, A...",NaN,NaN,left_only
998,tt1234567890,Top Speed,1930,"Comedy, Musical, Romance",USA,Mervyn LeRoy,"Joe E. Brown, Bernice Claire, Jack Whiting, Fr...",NaN,NaN,left_only
999,tt1234567890,True to the Navy,1930,"Action, Comedy, Romance",USA,Frank Tuttle,"Clara Bow, Fredric March, Harry Green, Rex Bel...",NaN,NaN,left_only